#1 დავწერე კოდი სადაც გავიგეთ მოცემული ასაკი მეტი იყო თუ არა 18 ან 50 ზე
#2 or ოპერატორის დახმარებით დავწერე კოდი რომელიც გაგვაგებინებს რომელი რიცხვებია მეტია 10 ზე ან ნაკლები 50ზე
#3 დავწეერე კოდი რომლის საშუალებითაც ვგებულობთ რომელი რიცხვი ან ციფრია მეტი 0 ზე ანუ დადებითი ან 0 ის ტოლი
#4 or ოპერატორის დახმარებით დავწერე კოდი რომლის საშუალებითაც ვგებულობთ მითითებული ცხოველი კატა, თაგვია თუ სულ სხვა არსება
#5 კოდი გვიჩვენებს რომელი რიცხვებია მოთავსებული 10-50 შუალედში დანარჩენებს კი გამორიცხავს
#6 დაწერილი კოდით ტერმინალს გამოაქვს მისალმების ერთი ან მოერე ფორმა