//გვერდით მიუწერეთ თუ რა იქნება ქვემოთ მოცემული მაგალითების შედეგი

//5>3 && 5 === 5 --> ...
//false && 10>45 --> ...
//4 != 5 && 50>124 --> ...
//4 < 1 && true --> ...


//true || false --> ... 
//4 === 6 || 5 == 5  --> ...
//5 > 3 || 9 === 9  --> ...
//4 < 24 || true --> ...




5 > 3 && 5 === 5    // true


false && 10 > 45   // false


4 != 5 && 50 > 124    // false


4 < 1 && true         // false

true || false       // true


4 === 6 || 5 == 5   // true


5 > 3 || 9 === 9      // true


4 < 24 || true     // true



