//)შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებ სტრინგს(პაროლს),ასევე შექმენი ცვლადი სადაც შეინახავ პაროლს,შემდეგ შეამოწმე,თუ მომხმარებლის შემოტანილი პაროლი არის იგივე პაროლი რაც შენ შეინახე ცვლადში,დაუპრინტე --> "you guessed" , სხვა შემთხვევაში დაგჭირდებათ ვაილ ლუპი რომელიც გააკეთებს შემოდეგ მოქმედებას --> სანამ მომხმარებლის პაროლი არ იქნება თქვენს მიერ შენახული პაროლისა,იქამდე გაუმეორეთ რომ თავიდან შემოიყვანოს მომხმარებელმა პაროლი,თუ პაროლი გაარტყა მაშინ აქაც დაუკონსოლლოგეთ --> "you guessed"

let correctPassword = "giorgi2004"
let userPassword = ""

while (userPassword !== correctPassword) {
  userPassword = prompt("გთხოვთ შეიყვანეთ პაროლი:")
  if (userPassword === correctPassword) {
    console.log("you guessed")
  } else {
    console.log("პაროლი არასწორია, სცადე ისევ")
  }
}
