#შექმენით სია რომელშიც მოათვსებთ 10 განსხვავებულ მანქანის სახელს, 1)შემდეგ დაბეჭდეთ ცალ ცალკე მეორე და მეხუთე ელემენტები, 2)დაბეჭდეთ თავიდან შუამდე ყველა ელემენტი, 3)დაბეჭდეთ შუიდან ბოლომდე ყველა ელემენტი, 4)დაბეჭდეთ მინუს 3 ინდექსზე და -1 ინდექსზე მდგომი ელემენტი, 

#1)
my_list = ["bmw", "toyota", "audi", "opel", "porshe", "mercedes-benz", "subaru", "ford", "range rover", "ferari"]

print(my_list[1])
print(my_list[4])


#2)
print(my_list[:5])


#3)
print(my_list[5:])

#4)
print(my_list[-3])
print(my_list[-1])








