//2)მომხმარებელს შემოატანინე რიამე რიცხვი 1იდან 10 მდე,თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის ლუწი,მაგ შემთხვევაში დაატრიალეთ ფორ ლუპი და ამ რიცხვიდან 50 მდე გამოიტანეთ ყველა ლუწი რიცხვი,და თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის კენტი,მაშინ დაატრიალეთ WHILE LOOP ამ რიცხვიდან 50 მდე და გამოიტანეთ ყველა კენტი რიცხვი


function fun1() {
    let num1 = Number(prompt("enter number between 1-10: "));

    if (num1 >= 1 && num1 < 10) {
        if (num1 % 2 === 0) {
            for (let i = num1; i <= 50; i++) {
                if (i % 2 === 0) {
                    console.log(i);
                }
            }
        } else {
            let i = num1;
            while (i < 50) {
                if (i % 2 !== 0) {
                    console.log(i);
                }
                i++;
            }
        }
    } else {
        console.log("შეიყვანე რიცხვი 1 ზე მეტი და 10 ზე ნაკლები");
    }
}



