//3)მომხმარებელს შემოატანინეთ რიცხვი,შემდეგ დაატრუალეთ ფორ ციკლი 1 იდან მომხმარებლის მიერ შემოტანილ რიცხვამდე და იპოვე ამ რიცხვების საშუალო არითმეტიკული,შემდეგ შეამოწმეთ,თუ მიღებული საშვალო არის 20ზე მეტი და ლუწი,მაშინ დააკონსოლლოგე რომ "good mark" შემდეგ შეამოწმეთ თ რს მიღებული საშვალო არის 20 ზე ნაკლები და კენტი დაუკონსოლლოგეთ --> 'very bad mark"



function fun1() {
    let num = Number(prompt("გთხოვთ შეიყვანეთ რიცხვი:"));
    let sum = 0;

    for (let i = 1; i <= num; i++) {
        sum += i;
    }

    let average = sum / num;

    if (average > 20 && average % 2 === 0) {
        console.log("good mark");
    }

    if (average < 20 && average % 2 !== 0) {
        console.log("very bad mark");
    }
}
